//================================================================================
//
// Auter : KENSUKE WATANABE
// Data  : 2016/05/30
//
//================================================================================
#ifndef _MAIN_H_
#define _MAIN_H_

//--------------------------------------------------------------------------------
// インクルードファイル
//--------------------------------------------------------------------------------
#include<Windows.h>
#include<d3dx9.h>

#pragma comment(lib,"d3d9.lib")
#pragma comment(lib,"d3dx9.lib")
#pragma comment(lib,"dxguid.lib")
#pragma comment(lib,"winmm.lib")	// システム時刻取得に必要

//--------------------------------------------------------------------------------
// 定数定義
//--------------------------------------------------------------------------------
#define SCREEN_WIDTH	( 1920 )		// 画面の横幅
#define SCREEN_HEIGHT	( 1080 )		// 画面の縦幅

#define RETURN_MIN(a, b) ((a) < (b) ? (a) : (b))	// 小さいほうを返す
#define RETURN_MAX(a, b) ((a) > (b) ? (a) : (b))	// 大きいほうを返す
#define RETURN_CLAMP(n, a, b) (RETURN_MIN(RETURN_MAX((n),(a)),(b)))	// 値or最小値or最大値を返す

//--------------------------------------------------------------------------------
// プロトタイプ宣言
//--------------------------------------------------------------------------------
int GetFPS();

#endif
